CATEGORY_MAPPING = {
    1: '原價轉讓',
    2: '換飛'
}

DATE_MAPPING = {
    503: '5.3(Fri)',
    504: '5.4(Sat)',
    505: '5.5(Sun)',
    510: '5.10(Fri)',
    511: '5.11(Sat)',
    512: '5.12(Sun)',
}

PRICE_MAPPING = {
    1: '$1180座位',
    2: '$880座位',
    3: '$680座位',
    4: '$480座位',
    5: '$680企位',
    6: '$1180 無障礙通道座位門票',
    7: '$880 無障礙通道座位門票'
}

STATUS_MAPPING = {
    1: '待交易',
    2: '洽談中',
    3: '已交易',
    4: '已取消',
    5: '黃牛飛'
}

SECTION_MAPPING = {
    'A1': '$1180 地面座位',
    'A2': '$1180 地面座位',
    'A3': '$1180 地面座位',
    'A4': '$1180 地面座位',
    'B1': '$1180 地面座位',
    'B2': '$1180 地面座位',
    'B3': '$1180 地面座位',
    'B4': '$1180 地面座位',
    'C1': '$880 梯級座位',
    'C2': '$880 梯級座位',
    'D1': '$880 地面座位',
    'D2': '$880 地面座位',
    'D3': '$880 地面座位',
    'D4': '$880 地面座位',
    'E1': '$880 地面座位',
    'E2': '$880 地面座位',
    'E3': '$880 地面座位',
    'E4': '$880 地面座位',
    'F1': '$880 梯級座位',
    'F2': '$880 梯級座位',
    'F3': '$880 梯級座位',
    'F4': '$880 梯級座位',
    'G1': '$680 企位',
    'G2': '$680 企位',
    'H1': '$680 梯級座位',
    'H2': '$480 梯級座位',
    'K1': '$680 梯級座位',
    'K2': '$480 梯級座位',
    'W-A4': '$1180 無障礙通道座位',
    'W-D1': '$880 無障礙通道座位',
    'W-D2': '$880 無障礙通道座位',
    'W-E1': '$880 無障礙通道座位',
}

SOURCE_MAPPING = {
    1: '東亞信用卡',
    2: '特高娛樂內部認購',
    3: '公開發售',
    4: '其他途徑'
}

TICKET_MAPPING = dict(
    category='門票類型',
    status='門票狀態',
    source='門票來源',
    date='日期',
    price='票面價格',
    quantity='數量',
    section='座位區域',
    row='座位行數',
    remarks='備註',
    update_at='更新時間',
    wish_dates='希望交換的日期',
    wish_price_ids='希望交換的價格種類',
    wish_quantities='希望交換的數量')

STAT_URL = 'https://www.google.com/'
